{"pages":[{"title":"Getting Started With GTD","url":"/posts/2018-02-28-Getting-started-with-GTD.html","text":"Getting Things Done, also known as “GTD” is a method to increase your productivity. This method was brought up by productivity consultant and author David Allen. Simply, GTD is a method for organizing your to-dos, priorities, and your schedule in a way that makes them all manageable. One of the biggest benefits is that it makes it easy to see what you have on your plate and choose what to work on next. It also has a strong emphasis on getting your to-dos out of your head and into a system you can refer to. This clears your mind of any mental distractions that will keep you from working efficiently.To get started with GTD, you should first understand three core principles and five-step process. Core principles of GTD: Don’t keep “stuff” in your head, write it down instead. Capture it so you don’t lose that great idea and you’re not fretting about forgetting a task. Writing it down frees your brain from trying to retain everything, so you can do actual creative problem solving. List what you are going to do next. Capture the stuff and transform it into outcomes and next steps. This will break down large projects into smaller, doable pieces, preventing you from overwhelmed. Trust your system to maintain the remaining steps for you- and every other idea you’ve captured. There are five steps for Getting Things Done: capture, clarify, organize, reflect, and engage. Capture everything. Your to-dos, your ideas, your recurring tasks, everything. Put it in a pen-and-paper notebook, a to-do app, a planner, whatever you prefer to use to get organized. GTD doesn’t say to use a specific tool, but whatever you use has to fit into your normal flow. The barrier to using it should be so low that there’s never a reason for you to say “I’ll add it to my list later.” You want to capture everything as soon as it happens so you don’t have to think about it again until it’s time to do it. Clarify the things you have to do. Don’t just write down “Plan vacation,” break it down into actionable steps so there’s no barrier to just doing the task. If there’s anything you can do right away and have time to do, get it done. If there’s anything you can delegate, delegate it. Here’s a helpful video where David Allen explains how to clarify your to-dos so they don’t require more time to figure out what you meant than it takes to actually do the thing you wanted to do. Organize those actionable items by category and priority. Assign due dates where you can, and set reminders so you follow up on them. Pay special attention to each item’s priority, as well. You’re not actually doing any of the items on your list right now, you’re just making sure they’re in the right buckets for later, and your reminders are set. In short, this is quality time with your to-do list, inbox, and calendar. Reflect on your to-do list. First, look over your to-dos to see what your next action should be. This is where the clarifying step pays off, because you should be able to pick something you have the time and the energy to do right away. If you see something that’s so vague that you know you won’t be able to just pick up and run with it, break it down. Second, give your to-do list an in-depth review periodically to see where you’re making progress, where you need to adjust your priorities, and determine how the system is working for you. Engage and get to work. Choose your next action and get to it. Your system is, as this point, set up to make figuring that out easy. Your to-dos are organized by priority and placed in categories. You know what to work on, and when. They’re broken into manageable, bite-sized chunks that are easy to start. It’s time to get to work. Works CitedHenry, A. (2014, 3 26). Productivity 101: A Primer to the Getting Things Done (GTD) Philosophy. Retrieved 2 27, 2018, from Life Hacker","tags":"gtd getting-things-done 时间管理"}]}